[Killed] BooleanLiteral
src/utils/sanitize.ts:6:7
  * Escapes special characters that could be used to break out of prompts
  */
 export function sanitizeInput(input: string): string {
-  if (!input || typeof input !== 'string') {
+  if (input || typeof input !== 'string') {
     return '';
   }
killedBy: Sanitization Utils - Edge Cases sanitizeInput - Edge Cases should handle extremely long strings
statusReason: expected '' to be 'aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa…' // Object.is equality

[Killed] ConditionalExpression
src/utils/sanitize.ts:6:7
  * Escapes special characters that could be used to break out of prompts
  */
 export function sanitizeInput(input: string): string {
-  if (!input || typeof input !== 'string') {
+  if (false) {
     return '';
   }
killedBy: Sanitization Utils sanitizeInput should handle empty strings
statusReason: Cannot read properties of null (reading 'replace')

[Killed] StringLiteral
src/utils/sanitize.ts:7:12
  */
 export function sanitizeInput(input: string): string {
   if (!input || typeof input !== 'string') {
-    return '';
+    return "Stryker was here!";
   }
 
killedBy: Sanitization Utils sanitizeInput should handle empty strings
statusReason: expected 'Stryker was here!' to be '' // Object.is equality

[Killed] StringLiteral
src/utils/sanitize.ts:16:21
     .replace(/'/g, "\\'") // Escape single quotes
     .replace(/\n/g, '\\n') // Escape newlines
     .replace(/\r/g, '\\r') // Escape carriage returns
-    .replace(/\t/g, '\\t') // Escape tabs
+    .replace(/\t/g, "") // Escape tabs
     .replace(/\0/g, '\\0'); // Escape null bytes
 }
killedBy: Sanitization Utils sanitizeInput should escape newlines and tabs
statusReason: expected 'Line1\nLine2Tabbed' to contain '\t'

[Killed] StringLiteral
src/utils/sanitize.ts:17:21
     .replace(/\n/g, '\\n') // Escape newlines
     .replace(/\r/g, '\\r') // Escape carriage returns
     .replace(/\t/g, '\\t') // Escape tabs
-    .replace(/\0/g, '\\0'); // Escape null bytes
+    .replace(/\0/g, ""); // Escape null bytes
 }
 
killedBy: Sanitization Utils - Edge Cases sanitizeInput - Edge Cases should handle null bytes
statusReason: expected 'teststring' to contain '\0'

[Killed] LogicalOperator
src/utils/sanitize.ts:25:7
  * Removes potentially dangerous HTML tags and attributes
  */
 export function sanitizeHtml(html: string): string {
-  if (!html || typeof html !== 'string') {
+  if (!html && typeof html !== 'string') {
     return '';
   }
killedBy: Coverage Boost: Branch Coverage sanitize branches should handle non-string inputs in sanitizeHtml
statusReason: html.replace is not a function

[Killed] BlockStatement
src/utils/sanitize.ts:25:42
  * Removes potentially dangerous HTML tags and attributes
  */
 export function sanitizeHtml(html: string): string {
-  if (!html || typeof html !== 'string') {
-    return '';
-  }
+  if (!html || typeof html !== 'string') {}
 
   return html
killedBy: Coverage Boost: Branch Coverage sanitize branches should handle non-string inputs in sanitizeHtml
statusReason: Cannot read properties of null (reading 'replace')

[Killed] Regex
src/utils/sanitize.ts:30:14
   }
 
   return html
-    .replace(/<script\b[^<]*(?:(?!<\/script>)<[^<]*)*<\/script>/gi, '') // Remove script tags
+    .replace(/<script\b[^<]*(?:(?!<\/script>)<[^<])*<\/script>/gi, '') // Remove script tags
     .replace(/on\w+\s*=\s*["'][^"']*["']/gi, '') // Remove event handlers
     .replace(/javascript:/gi, '') // Remove javascript: protocol
killedBy: Sanitization Utils - Edge Cases sanitizeHtml - Edge Cases should handle nested script tags
statusReason: expected '<div><script></script></div>' not to contain '<script>'

[Killed] Regex
src/utils/sanitize.ts:31:14
 
   return html
     .replace(/<script\b[^<]*(?:(?!<\/script>)<[^<]*)*<\/script>/gi, '') // Remove script tags
-    .replace(/on\w+\s*=\s*["'][^"']*["']/gi, '') // Remove event handlers
+    .replace(/on\w\s*=\s*["'][^"']*["']/gi, '') // Remove event handlers
     .replace(/javascript:/gi, '') // Remove javascript: protocol
     .replace(/<iframe\b[^<]*(?:(?!<\/iframe>)<[^<]*)*<\/iframe>/gi, ''); // Remove iframe tags
killedBy: Sanitization Utils - Edge Cases sanitizeHtml - Edge Cases should handle event handlers with encoded characters
statusReason: expected '<div onclick="alert(&#39;xss&#39;)">C…' not to contain 'onclick'

[Killed] Regex
src/utils/sanitize.ts:31:14
 
   return html
     .replace(/<script\b[^<]*(?:(?!<\/script>)<[^<]*)*<\/script>/gi, '') // Remove script tags
-    .replace(/on\w+\s*=\s*["'][^"']*["']/gi, '') // Remove event handlers
+    .replace(/on\w+\s*=\s*[^"'][^"']*["']/gi, '') // Remove event handlers
     .replace(/javascript:/gi, '') // Remove javascript: protocol
     .replace(/<iframe\b[^<]*(?:(?!<\/iframe>)<[^<]*)*<\/iframe>/gi, ''); // Remove iframe tags
killedBy: Sanitization Utils - Edge Cases sanitizeHtml - Edge Cases should handle event handlers with encoded characters
statusReason: expected '<div onclick="alert(&#39;xss&#39;)">C…' not to contain 'onclick'

[Survived] Regex
src/utils/sanitize.ts:33:14
     .replace(/<script\b[^<]*(?:(?!<\/script>)<[^<]*)*<\/script>/gi, '') // Remove script tags
     .replace(/on\w+\s*=\s*["'][^"']*["']/gi, '') // Remove event handlers
     .replace(/javascript:/gi, '') // Remove javascript: protocol
-    .replace(/<iframe\b[^<]*(?:(?!<\/iframe>)<[^<]*)*<\/iframe>/gi, ''); // Remove iframe tags
+    .replace(/<iframe\b[^<]*(?:(?!<\/iframe>)<[<]*)*<\/iframe>/gi, ''); // Remove iframe tags
 }
 

[Killed] ConditionalExpression
src/utils/sanitize.ts:41:7
  * Prevents injection attacks through location field
  */
 export function sanitizeLocation(location: string): string {
-  if (!location || typeof location !== 'string') {
+  if (true) {
     return '';
   }
killedBy: Sanitization Utils - Edge Cases sanitizeLocation - Edge Cases should handle mixed case and numbers
statusReason: expected '' to contain 'New'

[Killed] BooleanLiteral
src/utils/sanitize.ts:41:7
  * Prevents injection attacks through location field
  */
 export function sanitizeLocation(location: string): string {
-  if (!location || typeof location !== 'string') {
+  if (location || typeof location !== 'string') {
     return '';
   }
killedBy: Sanitization Utils - Edge Cases sanitizeLocation - Edge Cases should handle mixed case and numbers
statusReason: expected '' to contain 'New'

[Killed] StringLiteral
src/utils/sanitize.ts:42:12
  */
 export function sanitizeLocation(location: string): string {
   if (!location || typeof location !== 'string') {
-    return '';
+    return "Stryker was here!";
   }
 
killedBy: Sanitization Utils - Edge Cases sanitizeLocation - Edge Cases should handle empty string
statusReason: expected 'Stryker was here!' to be '' // Object.is equality

[Killed] MethodExpression
src/utils/sanitize.ts:46:10
   }
 
   // Allow only alphanumeric, spaces, hyphens, and commas
-  return location
-    .replace(/[^a-zA-Z0-9\s\-,]/g, '')
-    .trim()
-    .substring(0, 100); // Limit length
+  return location.replace(/[^a-zA-Z0-9\s\-,]/g, '').trim(); // Limit length
 }
 
killedBy: Sanitization Utils sanitizeLocation should limit length to 100 characters
statusReason: expected 150 to be less than or equal to 100

[Survived] MethodExpression
src/utils/sanitize.ts:46:10
   }
 
   // Allow only alphanumeric, spaces, hyphens, and commas
-  return location
-    .replace(/[^a-zA-Z0-9\s\-,]/g, '')
-    .trim()
+  return location.replace(/[^a-zA-Z0-9\s\-,]/g, '')
     .substring(0, 100); // Limit length
 }

[Killed] Regex
src/utils/sanitize.ts:56:22
  * Validate email format
  */
 export function isValidEmail(email: string): boolean {
-  const emailRegex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
+  const emailRegex = /^[\s@]+@[^\s@]+\.[^\s@]+$/;
   return emailRegex.test(email) && email.length <= 254;
 }
killedBy: Sanitization Utils isValidEmail should validate correct email addresses
statusReason: expected false to be true // Object.is equality

[Killed] Regex
src/utils/sanitize.ts:56:22
  * Validate email format
  */
 export function isValidEmail(email: string): boolean {
-  const emailRegex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
+  const emailRegex = /^[^\s@]+@[^\S@]+\.[^\s@]+$/;
   return emailRegex.test(email) && email.length <= 254;
 }
killedBy: Sanitization Utils isValidEmail should validate correct email addresses
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/utils/sanitize.ts:57:36
  */
 export function isValidEmail(email: string): boolean {
   const emailRegex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
-  return emailRegex.test(email) && email.length <= 254;
+  return emailRegex.test(email) && true;
 }
 
killedBy: Sanitization Utils - Edge Cases isValidEmail - Edge Cases should reject emails longer than 254 characters
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/utils/sanitize.ts:57:10
  */
 export function isValidEmail(email: string): boolean {
   const emailRegex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
-  return emailRegex.test(email) && email.length <= 254;
+  return false;
 }
 
killedBy: Sanitization Utils - Edge Cases isValidEmail - Edge Cases should accept emails with subdomains
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/utils/sanitize.ts:66:12
 export function isValidUrl(url: string): boolean {
   try {
     new URL(url);
-    return true;
+    return false;
   } catch {
     return false;
killedBy: Sanitization Utils - Edge Cases isValidUrl - Edge Cases should accept URLs with ports
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/utils/sanitize.ts:76:40
  * Truncate string to maximum length
  */
 export function truncateString(str: string, maxLength: number): string {
-  if (!str || typeof str !== 'string') {
-    return '';
-  }
+  if (!str || typeof str !== 'string') {}
   return str.substring(0, maxLength);
 }
killedBy: Sanitization Utils - Edge Cases truncateString - Edge Cases should handle null input
statusReason: Cannot read properties of null (reading 'substring')

[Killed] ConditionalExpression
src/utils/sanitize.ts:76:7
  * Truncate string to maximum length
  */
 export function truncateString(str: string, maxLength: number): string {
-  if (!str || typeof str !== 'string') {
+  if (true) {
     return '';
   }
killedBy: Sanitization Utils - Edge Cases truncateString - Edge Cases should handle very large max length
statusReason: expected '' to be 'Hello' // Object.is equality

[Killed] MethodExpression
src/utils/sanitize.ts:79:10
   if (!str || typeof str !== 'string') {
     return '';
   }
-  return str.substring(0, maxLength);
+  return str;
 }
 
killedBy: Sanitization Utils - Edge Cases truncateString - Edge Cases should handle zero length
statusReason: expected 'Hello World' to be '' // Object.is equality
